---
kind: enumMember
id: F:Autodesk.Revit.DB.CutFailureReason.OppositeCutExists
enum: Autodesk.Revit.DB.CutFailureReason
source: html/3ab731f0-b37a-49b9-0419-b5ca48df783d.htm
---
# Autodesk.Revit.DB.CutFailureReason.OppositeCutExists

The target element has already cut the cutting element.